import React from "react";
import CareerBlock from "./component/HeaderSection";

function page() {
  return (
    <div className="min-h-screen w-full">
      <CareerBlock />
      <p>
        {" "}
        المملكة العربية السعودية: على مستوى العالم: Accenture واحدة من أكبر
        شركات التكنولوجيا والاستشارات في العالم، تقدم خدمات تطوير المواقع
        والتطبيقات للشركات الكبرى. الموقع: accenture.com Tata Consultancy
        Services (TCS) شركة هندية رائدة في مجال تطوير البرمجيات والتطبيقات، ولها
        حضور قوي في السوق العالمية. الموقع: tcs.com Infosys شركة عالمية متخصصة
        في تطوير التطبيقات والمواقع الإلكترونية، مع تركيز على الابتكار والحلول
        الرقمية. الموقع: infosys.com IBM iX قسم من شركة IBM متخصص في تصميم
        وتطوير المواقع والتطبيقات الذكية مع حلول متكاملة. الموقع:
        ibm.com/services/ibmix Wipro شركة عالمية تقدم خدمات تطوير البرمجيات
        والتطبيقات للشركات متعددة الجنسيات. الموقع: wipro.com على مستوى المملكة
        العربية السعودية: شركة تطوير (Tatweer) واحدة من أبرز الشركات السعودية
        المتخصصة في تطوير التطبيقات والمواقع الإلكترونية، مع تركيز على القطاع
        الحكومي والتعليمي. الموقع: tatweer.sa شركة سوفتكس (Softex Software
        House) شركة سعودية رائدة في تطوير التطبيقات والمواقع الإلكترونية، مع
        مجموعة كبيرة من العملاء المحليين والدوليين. الموقع: softexsw.com شركة
        إرنست ويونغ (EY) السعودية تقدم خدمات تطوير التطبيقات والمواقع
        الإلكترونية مع حلول رقمية متكاملة للشركات الكبرى. الموقع: ey.com/sa شركة
        إبداع (Ebdaa) متخصصة في تطوير التطبيقات الذكية والمواقع الإلكترونية
        للشركات الناشئة والمؤسسات الكبرى. الموقع: ebdaa.com.sa شركة تكامل
        (Takamol) شركة سعودية تقدم خدمات تطوير التطبيقات والمواقع الإلكترونية مع
        تركيز على الحلول الحكومية والاجتماعية. الموقع: takamol.sa هذه الشركات
        تتمتع بسمعة قوية في مجال تطوير المواقع والتطبيقات، سواء على المستوى
        العالمي أو المحلي في المملكة العربية السعودية.
      </p>
    </div>
  );
}

export default page;
